{"src/common/commandExecutor":["Narzędzie do tworzenia pakietów zostało zatrzymane","Nie znaleziono narzędzia do tworzenia pakietów"],"src/common/packager":["Nie można odczytać opcji narzędzia do tworzenia pakietów z pliku exp.json, kontynuowanie...","Uruchamianie narzędzia do tworzenia pakietów","Narzędzie do tworzenia pakietów zostało uruchomione.","Narzędzie do tworzenia pakietów jest już uruchomione.","Narzędzie do tworzenia pakietów platformy React Native jest uruchomione poza programem VS Code. Jeśli chcesz debugować, użyj opcji „Attach to packager” (Dołącz do narzędzia do tworzenia pakietów)","Narzędzie do tworzenia pakietów nadal działa. Jeśli narzędzie do tworzenia pakietów było uruchomione poza programem VS Code, zakończ proces narzędzia do tworzenia pakietów za pomocą Menedżera zadań.","Narzędzie do tworzenia pakietów nie jest uruchomione","Narzędzie do tworzenia pakietów nadal działa. Jeśli narzędzie do tworzenia pakietów było uruchomione poza programem VS Code, zakończ proces narzędzia do tworzenia pakietów za pomocą Menedżera zadań.","Narzędzie do tworzenia pakietów nie jest uruchomione","Punkt wejścia nie istnieje w pliku index.js ani w pliku index.{0}.js. Pomijanie wstępnego zapełniania...","Zamierzasz pobrać: {0}","Pamięć podręczna pakietu została wstępnie zapełniona.","Nie można uruchomić narzędzia do tworzenia pakietów.","Trwa zatrzymywanie narzędzia do tworzenia pakietów"],"src/common/error/errorStrings":["Wystąpił błąd podczas wykonywania polecenia „{0}”","Polecenie „{0}” nie powiodło się. Kod błędu: {1}","Oczekiwano liczby całkowitej. Nie można odczytać {0}","Błąd podczas wykonywania narzędzia do tworzenia pakietów platformy React Native.","Nie można odnaleźć narzędzia ios-deploy. Upewnij się, że zainstalowano je globalnie („npm install -g ios-deploy”)","Nie można zainstalować obrazu dysku dewelopera.","Nie można zainstalować obrazu dysku dewelopera.","Nie można uruchomić aplikacji.","Przekroczono limit czasu podczas uruchamiania aplikacji. Czy urządzenie jest zablokowane?","Nie można uruchomić symulatora systemu iOS. Spróbuj określić inny element docelowy.","Nie znaleziono lokalizacji pakietu opn","Nie znaleziono pakietu „opn”. {0}","Próba znalezienia pakietu {0} nie powiodła się z powodu błędu: {1}","Platforma „{0}” nie jest obsługiwana na platformie hosta: {1}","Nie można przeanalizować składnika wersji pakietu w {0}: wersja = {1}","Wersja projektu = {0}","Couldn't find React Native version in the current workspace or folder","Nie można odczytać wersji = {0}","{0}. Nie można zainicjować telemetrii","Nie można aktywować rozszerzenia narzędzi React Native Tools","Nie można skonfigurować elementu uruchamiającego klasy zastępczej dla debugera","Nie można zainstalować funkcji IntelliSense","Nie można skonfigurować lokalizacji debugera węzła dla debugera","Nie można zatrzymać narzędzia do tworzenia pakietów podczas zamykania narzędzi React Native Tools","Nie można uruchomić aplikacji w systemie Android","Nie można uruchomić aplikacji w systemie iOS","Nie można uruchomić aplikacji w środowisku Expo","Nie można uruchomić aplikacji w środowisku Expo","Nie można uruchomić narzędzia do tworzenia pakietów platformy React Native","Nie można zatrzymać narzędzia do tworzenia pakietów platformy React Native","Nie można ponownie uruchomić narzędzia do tworzenia pakietów platformy React Native","Nie można debugować aplikacji","Nie można debugować aplikacji z powodu błędu wewnętrznego debugera węzła","Nie można usunąć folderu tymczasowego {0}","Nie można odnaleźć lokalizacji rozszerzenia debugera węzła","Couldn't find any workspace or React Native project folder","Nie można uruchomić narzędzia do tworzenia pakietów na porcie {0}, ponieważ proces narzędzia do tworzenia pakietów jest już uruchomiony na porcie {1}","Wystąpił błąd podczas obsługi komunikatu: {0}","Nie można skonfigurować komunikacji z rozszerzeniem platformy React Native programu VSCode. Czy to jest projekt platformy React Native i upewniono się, że pakiet npm react-native został zainstalowany w katalogu głównym?","Nieznany błąd: nie wszystkie wzorce powodzenia zostały dopasowane. \n Oznacza to, że polecenie „react-native run-{0}” nie powiodło się. \n Sprawdź pozycje Widok -> Przełącz wyjście -> React Native, \nWidok -> Przełącz wyjście -> React Native: uruchom okna wyjściowe {1}.","Nie można przeanalizować składnika wersji pakietu w {0}: wersja = {1}","Nieobsługiwany stan polecenia","Brak linku udostępnionego przez środowisko Expo. Czy projekt jest poprawnie skonfigurowany?","Wystąpił błąd podczas pracy z obszarem roboczym: {0}","Wersja platformy React Native nie jest obsługiwana przez środowisko Expo. Obsługiwane wersje główne: {0}","Logowanie anulowane przez użytkownika.","Nie można dołączyć do narzędzia do tworzenia pakietów. Czy narzędzie do tworzenia pakietów istnieje i działa na porcie {0}? Jeśli narzędzie do tworzenia pakietów jest skonfigurowane do uruchamiania na innym porcie, to ustawienie musi zostać dodane do pliku settings.json.","Inny debuger jest już połączony z narzędziem do tworzenia pakietów. Zamknij go przed podjęciem próby debugowania za pomocą programu VSCode.","Wygląda na to, że próbujesz debugować z katalogu, który nie jest katalogiem głównym projektu platformy React Native. \n Jeśli tak, wykonaj instrukcje podane tutaj: https://github.com/Microsoft/vscode-react-native/blob/master/doc/customization.md#project-structure.","Argument SourcesStoragePath ma wartość null lub jest pusty","Nie można zainstalować aplikacji na żadnym dostępnym urządzeniu. Upewnij się, że masz działające \n prawidłowo skonfigurowane urządzenie lub emulator. Zobacz https://facebook.github.io/react-native/docs/android-setup.html.","Przekroczono limit czasu polecenia powłoki systemu Android. Spróbuj ponownie wykonać operację.","Nie znaleziono projektu dla systemu Android.","Więcej niż jedno urządzenie/emulator","Nie można uruchomić określonego działania. Spróbuj uruchomić aplikację ręcznie i uruchom debugowanie przy użyciu konfiguracji uruchamiania „Attach to packager” (Dołącz do narzędzia do tworzenia pakietów).","W folderze {0} znaleziono więcej niż jeden plik wykonywalny. Oczyść folder kompilacji lub zainstaluj opcję uruchamiania „productName”.","Nie można odnaleźć pliku wykonywalnego w {0}","Wtyczka „rnpm-plugin-windows” nie jest zainstalowana.","Pakiet React Devtools nie jest zainstalowany. Uruchom polecenie „npm install -g react-devtools” w terminalu, aby go zainstalować.","{0}. Debugowanie nie będzie działać. Spróbuj ponownie załadować kod JS z wewnątrz aplikacji lub podłącz ponownie debuger programu VS Code","Ponowne nawiązanie połączenia z serwerem proxy (narzędziem do tworzenia pakietów) nie powiodło się. Sprawdź okno danych wyjściowych pod kątem błędów narzędzia do tworzenia pakietów, jeśli wystąpiły. Jeśli problem będzie się powtarzał, uruchom ponownie debuger platformy React Native.","Nie można przetworzyć komunikatu z aplikacji platformy React Native. Komunikat:\n{0}","Nie można przygotować środowiska uruchomieniowego języka JavaScript. Komunikat:\n{0}","Nie można wysłać komunikatu do aplikacji platformy React Native. Komunikat:\n{0}","Proces roboczy języka React Native zgłosił błąd","Nie można zaimportować skryptu w <{0}>","Klasa RNMessage z metodą „executeApplicationScript” nie ma właściwości „url”"],"src/debugger/appWorker":["Odłączono od serwera proxy (narzędzia do tworzenia pakietów) do aplikacji platformy React Native. Ponawianie próby ponownego połączenia nastąpi wkrótce...","Ustanowiono połączenie z serwerem proxy (narzędziem do tworzenia pakietów) z aplikacją platformy React Native"],"src/debugger/nodeDebugWrapper":["Nie można zatrzymać narzędzia logcat monitorowania: {0}","Uruchomiona konfiguracja debugowania zawiera właściwość „program“, która jest przestarzała i zostanie wkrótce usunięta. Zamień ją na \"cwd\": \"${workspaceFolder}\"","Uruchamianie procesu roboczego aplikacji debugera.","Proces roboczy debugera załadował środowisko uruchomieniowe na porcie {0}","Nie można debugować. {0}"],"src/debugger/reactNativeDebugEntryPoint":["Nie można uruchomić adaptera debugowania: {0}"],"src/extension/commandPaletteHandler":["Publikowanie nie powiodło się. Sprawdź, czy użytkownik jest zalogowany w środowisku Expo, a projektu jest prawidłowym projektem środowiska Expo","Inny inspektor elementów jest już uruchomiony","Trwa publikowanie aplikacji na serwerze środowiska Expo. Może to chwilę potrwać.","Aplikacja środowiska Expo została pomyślnie opublikowana w {0}","Wystąpił błąd. Upewnij się, że zalogowano się do środowiska Expo, projekt jest prawidłowo skonfigurowany na potrzeby publikowania, a narzędzie do tworzenia pakietów jest uruchomione jako środowisko Expo."],"src/extension/debugConfigurationProvider":["Uruchom i debuguj aplikację systemu Android","Uruchom i debuguj aplikację systemu iOS","Dołącz do już działającego narzędzia do tworzenia pakietów aplikacji","Debugowanie aplikacji środowiska Expo lub aplikacji platformy React Native w środowisku Expo","Wybierz konfiguracje debugowania"],"src/extension/extensionServer":["Trwa wstępne zapełnianie pamięci podręcznej pakietu. To może chwilę potrwać...","Kompilowanie i uruchamianie aplikacji.","Włącz debugowanie JavaScript"],"src/extension/generalMobilePlatform":["React Native: uruchom {0}","Połączono z narzędziem do tworzenia pakietów. Teraz możesz otworzyć aplikację w symulatorze.","Debuger jest gotowy. Włącz debugowanie zdalne w aplikacji.","Debuger jest gotowy. Wyłącz debugowanie zdalne w aplikacji.","Uruchamianie narzędzia do tworzenia pakietów platformy React Native.","Dołączanie do uruchomionego narzędzia do tworzenia pakietów platformy React Native"],"src/extension/openFileAtLocation":["Niewłaściwa liczba dostarczonych parametrów. Zapoznaj się z użyciem tego skryptu w celu prawidłowego zastosowania."],"src/extension/packagerStatusIndicator":["Uruchom narzędzie do tworzenia pakietów","Uruchom ponownie narzędzie do tworzenia pakietów","Uruchom narzędzie do tworzenia pakietów","Zatrzymaj narzędzie do tworzenia pakietów","Narzędzie do tworzenia pakietów platformy React Native","{0}: Zatrzymano","{0}: Zatrzymywanie","{0}: Uruchomiono","{0}: Uruchamianie"],"src/extension/qrCodeContentProvider":["Środowisko Expo jest uruchomione. Otwórz aplikację Expo w<br/><span style=\"text-decoration: underline\">{0}</span><br/>lub zeskanuj poniższy kod QR:"],"src/extension/rn-extension":["Narzędzia platformy React Native wymagają zainstalowania platformy React Native w wersji 0.19.0 lub nowszej w folderze <PROJECT_ROOT>/node_modules/","React Native: wyświetlanie menu deweloperskiego dla aplikacji","React Native: ponowne ładowanie aplikacji","React Native: uruchamianie inspektora elementów"],"src/extension/android/adb":["Nie znaleziono wartości sdk.dir w pliku local.properties. Używana jest lokalizacja zestawu Android SDK ze ścieżki PATH.","Używana jest lokalizacja zestawu Android SDK zdefiniowana w pliku android/local.properties: {0}.","Plik local.properties nie istnieje. Używana jest lokalizacja zestawu Android SDK ze ścieżki PATH.","Nie można odczytać z: {0}.","Używana jest lokalizacja zestawu Android SDK ze ścieżki PATH."],"src/extension/android/androidPlatform":["Element docelowy {0} nie jest obsługiwany dla platformy systemu Android. \n Jeśli chcesz użyć określonego urządzenia lub symulatora do uruchamiania aplikacji dla systemu Android,\n podaj identyfikator urządzenia (jak w danych wyjściowych „adb devices”).","Urządzenie {0} obsługuje tylko poziom interfejsu API {1}. \n Poziom {2} jest potrzebny do obsługi przekierowania portów za pomocą polecenia adb reverse. \n Aby debugowanie działało, musisz <Shake or press menu button> dla menu deweloperskiego, \n przejść do <Dev Settings> i skonfigurować <Debug Server host & port for Device> na \n adres IP komputera, z którym urządzenie może nawiązać połączenie. Więcej informacji: \n https://facebook.github.io/react-native/docs/debugging.html#debugging-react-native-apps","Błąd podczas monitorowania narzędzia LogCat"],"src/extension/android/logCatMonitor":["Monitorowanie narzędzia LogCat zostało zatrzymane, ponieważ proces został zakończony.","Monitorowanie narzędzia LogCat zostało zatrzymane, ponieważ sesja debugowania została zakończona"],"src/extension/exponent/exponentHelper":["Upewnianie się, że projekt używa prawidłowych zależności dla środowiska Expo. Może to chwilę potrwać...","Sprawdzanie, czy to jest aplikacja środowiska Expo.","[Ostrzeżenie] Upewnij się, że pakiet środowiska Expo został zainstalowany lokalnie dla projektu, w przeciwnym razie mogą wystąpić dalsze błędy. Uruchom polecenie „npm install expo --save-dev” wewnątrz projektu w celu jego zainstalowania.","Musisz się zalogować w środowisku Expo. Podaj nazwę konta użytkownika środowiska Expo i hasło w polach wejściowych po zamknięciu tego okna. Jeśli nie masz konta, przejdź na stronę https://expo.io, aby je utworzyć.","Nazwa użytkownika środowiska Expo","Hasło środowiska Expo"],"src/extension/exponent/exponentPlatform":["Aplikacja działa w środowisku Expo. Otwórz aplikację środowiska Expo w {0}, aby ją zobaczyć.","Aplikacja działa w środowisku Expo. Potrząśnij urządzeniem i wybierz opcję „Debug JS Remotely” (Debuguj JS zdalnie), aby włączyć debugowanie."],"src/extension/ios/iOSDebugModeManager":["Nie można odnaleźć pliku plist, aby skonfigurować debugowanie"],"src/extension/ios/iOSPlatform":["Opcja „iosRelativeProjectPath” jest przestarzała. Zamiast tego użyj opcji „runArguments”.","Parametr „--schema” jest ustawiony jako wartość parametru konfiguracji „runArguments”; wartość parametru konfiguracji „Schema” zostanie pominięta"],"src/extension/ios/simulatorPlist":["Znaleziono wiele kandydatów plist. Aplikacja może nie być w trybie debugowania."],"src/extension/windows/wpfPlatform":["Debugowanie platformy WPF nie jest obsługiwana dla tej wersji pakietu react-native-windows ({0})"]}