{"src/common/commandExecutor":["Empacotador interrompido","Empacotador não encontrado"],"src/common/packager":["Não foi possível ler as opções do empacotador de exp.json, continuar...","Iniciando o Empacotador","Empacotador iniciado.","O empacotador já está em execução.","O Empacotador React Native está em execução fora do VS Code. Se deseja depurar, use a opção 'Anexar ao empacotador'","O empacotador ainda está em execução. Se o empacotador foi iniciado fora do VS Code, encerre o processo do empacotador usando o gerenciador de tarefas.","O empacotador não está em execução","O empacotador ainda está em execução. Se o empacotador foi iniciado fora do VS Code, encerre o processo do empacotador usando o gerenciador de tarefas.","O empacotador não está em execução","O ponto de entrada não existe no index.js nem no index.{0}.js. Ignorar pré-aquecimento...","Prestes a obter: {0}","O Cache do Conjunto foi pré-aquecido.","Não foi possível iniciar o empacotador.","Parando o Empacotador"],"src/common/error/errorStrings":["Erro ao executar o comando '{0}'","Falha no comando '{0}' com o código de erro {1}","Esperado um inteiro. Não foi possível ler {0}","Erro ao executar o Empacotador React Native.","Não é possível localizar o ios-deploy. Instale-o globalmente ('npm install -g ios-deploy')","Não é possível montar a imagem do disco do desenvolvedor.","Não é possível montar a imagem do disco do desenvolvedor.","Não é possível iniciar o aplicativo.","Tempo limite atingido ao iniciar o aplicativo. O dispositivo está bloqueado?","Não é possível iniciar o simulador do iOS. Tente especificar um destino diferente.","Local do pacote Opn não encontrado","O pacote 'opn' não foi encontrado. {0}","Falha na tentativa de localizar o pacote {0} com o erro: {1}","A plataforma '{0}' não é compatível com a plataforma do host: {1}","Não foi possível analisar o componente de versão do pacote em {0}: versão = {1}","Versão do projeto = {0}","Couldn't find React Native version in the current workspace or folder","Não é possível ler a versão = {0}","{0}. Não foi possível inicializar a telemetria","Falha ao ativar a extensão Ferramentas React Native","Falha ao configurar o iniciador de stub para o depurador","Falha ao configurar o IntelliSense","Falha ao configurar o local do depurador de nó para o depurador","Falha ao parar o empacotador ao fechar as Ferramentas React Native","Falha ao executar o aplicativo no Android","Falha ao executar o aplicativo no iOS","Falha ao executar o aplicativo no Expo","Falha ao executar o aplicativo no Expo","Falha ao iniciar o empacotador React Native","Falha ao parar o empacotador React Native","Falha ao reiniciar o empacotador React Native","Não é possível depurar o aplicativo","Não é possível depurar o aplicativo devido a um erro no Depurador do Node interno","Não foi possível excluir a pasta temporária {0}","Não foi possível encontrar o local da extensão node-debugger","Couldn't find any workspace or React Native project folder","Um empacotador não pode ser iniciado na porta {0} porque um processo de empacotador já está em execução na porta {1}","Erro ao manipular a mensagem: {0}","Não é possível configurar a comunicação com a extensão react-native do VSCode. Este é um projeto react-native? Você verificou se o pacote npm do react-native está instalado na raiz?","Erro desconhecido: nem todos os padrões de sucesso corresponderam. \n Isso significa que o comando \"react-native run-{0}\" falhou. \n Verifique as janelas de saída Exibição -> Ativar/desativar Saída -> React Native, \n Exibição -> Ativar/desativar Saída -> React Native: executar {1}.","Não foi possível analisar o componente de versão do pacote em {0}: versão = {1}","Status do comando sem suporte","Não foi fornecido nenhum link pelo Expo. O projeto está configurado corretamente?","Erro ao trabalhar com o workspace: {0}","A versão do React Native não é compatível com o Expo. Versões principais compatíveis: {0}","Logon cancelado pelo usuário.","Não é possível anexar ao empacotador. Tem certeza de que há um empacotador e que ele está em execução na porta {0}? Se o empacotador estiver configurado para ser executado em outra porta, adicione-a ao settings.json.","Outro depurador já está conectado ao empacotador. Feche-o antes de tentar a depuração com o VSCode.","Parece que você está tentando depurar de dentro de um diretório que não é uma raiz do projeto React Native. \n Em caso afirmativo, siga estas instruções: https://github.com/Microsoft/vscode-react-native/blob/master/doc/customization.md#project-structure.","O argumento sourcesStoragePath era nulo ou estava vazio","Não foi possível instalar o aplicativo em nenhum dispositivo disponível. Verifique se há um dispositivo ou emulador configurado \n corretamente em execução. Confira https://facebook.github.io/react-native/docs/android-setup.html.","Um comando do shell do Android atingiu o tempo limite. Repita a operação.","Projeto do Android não encontrado.","Mais de um dispositivo/emulador","Falha ao iniciar a atividade especificada. Tente executar o aplicativo manualmente e iniciar a depuração usando a configuração de inicialização 'Anexar ao empacotador'.","Foram encontrados mais de um executáveis em {0}. Limpe a pasta de build ou configure a opção de inicialização 'productName'.","Não foi possível encontrar o executável em {0}","O 'rnpm-plugin-windows' não está instalado.","O React Devtools não está instalado. Execute o comando `npm install -g react-devtools` no terminal para instalá-lo.","{0}. A depuração não funcionará: tente recarregar o JS de dentro do aplicativo ou Reconectar o depurador do VS Code","Falha na reconexão com o proxy (Empacotador). Verifique se na janela de Saída há algum erro do Empacotador. Se a falha persistir, reinicie o depurador React Native.","Falha ao processar a mensagem do aplicativo React Native. Mensagem:\n{0}","Falha ao preparar o ambiente de tempo de execução do JavaScript. Mensagem:\n{0}","Falha ao enviar a mensagem para o aplicativo React Native. Mensagem:\n{0}","O processo de trabalho do React Native gerou um erro","Não foi possível importar o script em <{0}>","A RNMessage com o método 'executeApplicationScript' não tem a propriedade 'url'"],"src/debugger/appWorker":["O Proxy (Empacotador) foi desconectado do aplicativo React Native. A reconexão será repetida em breve...","Uma conexão foi estabelecida entre o Proxy (Empacotador) e o aplicativo React Native"],"src/debugger/nodeDebugWrapper":["Não foi possível interromper o monitoramento de logcat: {0}","A configuração de depuração iniciada contém a propriedade 'program', que foi preterida e será removida em breve. Substitua-a por: \"cwd\": \"${workspaceFolder}\"","Iniciando o trabalho do aplicativo depurador.","Tempo de execução do trabalho do depurador carregado na porta {0}","Não foi possível depurar. {0}"],"src/debugger/reactNativeDebugEntryPoint":["Não é possível iniciar o adaptador de depuração: {0}"],"src/extension/commandPaletteHandler":["A publicação foi malsucedida. Verifique se você está conectado ao Expo e se o projeto é um projeto Expo válido","Outro inspetor de elementos já foi executado","Publicando aplicativo no servidor Expo. Isso pode demorar um pouco.","O aplicativo Expo foi publicado com êxito em {0}","Erro. Verifique se você está conectado ao Expo, se o projeto está configurado corretamente para a publicação e se o empacotador está sendo executado como Expo."],"src/extension/debugConfigurationProvider":["Executar e depurar o aplicativo Android","Executar e depurar o aplicativo iOS","Anexar ao empacotador de aplicativo que já está funcionando","Depurar o aplicativo Expo ou o aplicativo React Native em Expo","Escolher configurações de depuração"],"src/extension/extensionServer":["Pré-aquecendo o cache do conjunto. Isso pode demorar um pouco...","Criando e executando o aplicativo.","Habilitar a Depuração do JS"],"src/extension/generalMobilePlatform":["React Native: executar {0}","Conectado ao empacotador. Agora você pode abrir o aplicativo no simulador.","Depurador pronto. Habilite a depuração remota no aplicativo.","Depurador pronto. Desabilite a depuração remota no aplicativo.","Iniciando o Empacotador React Native.","Anexando ao empacotador React Native em execução"],"src/extension/openFileAtLocation":["Número incorreto de parâmetros fornecido. Veja o uso desse script para saber como usá-lo corretamente."],"src/extension/packagerStatusIndicator":["Iniciar Empacotador","Reiniciar Empacotador","Iniciar Empacotador","Parar Empacotador","Empacotador React Native","{0}: parado","{0}: parando","{0}: iniciado","{0}: iniciando"],"src/extension/qrCodeContentProvider":["O Expo está em execução. Abra o aplicativo Expo em<br/><span style=\"text-decoration: underline\">{0}</span><br/>ou verifique o código QR abaixo:"],"src/extension/rn-extension":["O React Native Tools precisa do React Native versão 0.19.0 ou posterior para ser instalado em <PROJECT_ROOT>/node_modules/","React Native: mostrar o Menu do Desenvolvedor do aplicativo","React Native: recarregar Aplicativo","React Native: executar Inspetor de Elementos"],"src/extension/android/adb":["Não foi encontrado nenhum valor de sdk.dir no arquivo local.properties. Usando o local do SDK do Android do CAMINHO.","Usando o local do SDK do Android definido no arquivo android/local.properties: {0}.","O arquivo local.properties não existe. Usando o local do SDK do Android do CAMINHO.","Não foi possível ler de {0}.","Usando o local do SDK do Android do CAMINHO."],"src/extension/android/androidPlatform":["O destino {0} não é compatível com a plataforma Android. \n Se você deseja usar um dispositivo ou simulador específico para iniciar o aplicativo Android, \n especifique a ID do dispositivo (como na saída 'adb devices').","O dispositivo {0} é compatível apenas com o Nível da API {1}. \n O Nível {2} é necessário para dar suporte ao encaminhamento de porta por adb reverso. \n Para que a depuração funcione, você precisará <Agitar ou pressionar o botão de menu> do menu de desenvolvimento, \n acessar as <Configurações de Desenvolvimento> e configurar o <host e a porta do Servidor de Depuração do Dispositivo> como \n um endereço IP do computador que o Dispositivo pode acessar. Mais informações em: \n https://facebook.github.io/react-native/docs/debugging.html#debugging-react-native-apps","Erro ao monitorar o LogCat"],"src/extension/android/logCatMonitor":["O monitoramento de LogCat parou porque o processo foi encerrado.","O monitoramento de LogCat parou porque a sessão de depuração foi concluída"],"src/extension/exponent/exponentHelper":["Verifique se o projeto usa as dependências corretas para Expo. Isso pode demorar um pouco...","Verificando se esse é um aplicativo Expo.","[Aviso] Verifique se esse pacote expo está instalado localmente no seu projeto. Caso contrário, poderão ocorrer mais erros. Execute \"npm install expo --save-dev\" dentro do projeto para instalá-lo.","Você deve entrar no Expo. Forneça o nome de usuário e a senha da conta do Expo nas caixas de entrada depois de fechar esta janela. Se você não tiver uma conta, acesse https://expo.io para criar uma.","Nome de usuário do Expo","Senha do Expo"],"src/extension/exponent/exponentPlatform":["O aplicativo está em execução no Expo. Abra o aplicativo Expo em {0} para vê-lo.","O aplicativo está em execução no Expo. Agite o dispositivo e selecione 'Depurar JS Remotamente' para habilitar a depuração."],"src/extension/ios/iOSDebugModeManager":["Não é possível localizar o arquivo plist para configurar a depuração"],"src/extension/ios/iOSPlatform":["A opção 'iosRelativeProjectPath' foi preterida. Nesse caso, use 'runArguments'.","'--scheme' está definido como valor do parâmetro de configuração 'runArguments'. O valor do parâmetro de configuração 'scheme' será omitido"],"src/extension/ios/simulatorPlist":["Foram encontrados vários candidatos à plist. O aplicativo não pode estar no modo de depuração."],"src/extension/windows/wpfPlatform":["Não há suporte para a depuração da plataforma WPF nesta versão ({0}) do react-native-windows"]}