{"src/common/commandExecutor":["Packager stopped","Packager not found"],"src/common/packager":["Couldn't read packager's options from exp.json, continue...","Starting Packager","Packager started.","Packager is already running.","React Native Packager running outside of VS Code. If you want to debug please use the 'Attach to packager' option","Packager is still running. If the packager was started outside VS Code, please quit the packager process using the task manager.","Packager is not running","Packager is still running. If the packager was started outside VS Code, please quit the packager process using the task manager. Then try the restart packager again.","Packager is not running","Entry point doesn't exist neither at index.js nor index.{0}.js. Skip prewarming...","About to get: {0}","The Bundle Cache was prewarmed.","Could not start the packager.","Stopping Packager"],"src/common/error/errorStrings":["Error while executing command '{0}'","Command '{0}' failed with error code {1}","Expected an integer. Couldn't read {0}","Error while executing React Native Packager.","Unable to find ios-deploy. Please make sure to install it globally('npm install -g ios-deploy')","Unable to mount developer disk image.","Unable to mount developer disk image.","Unable to launch application.","Timeout launching application. Is the device locked?","Unable to launch iOS simulator. Try specifying a different target.","Opn package location not found","The package 'opn' was not found. {0}","Attempting to find package {0} failed with error: {1}","Platform '{0}' is not supported on host platform: {1}","Couldn't parse the version component of the package at {0}: version = {1}","Project version = {0}","Couldn't find React Native version in the current workspace or folder","Unable to read version = {0}","{0}. Couldn't initialize telemetry","Failed to activate the React Native Tools extension","Failed to setup the stub launcher for the debugger","Failed to setup IntelliSense","Failed to configure the node debugger location for the debugger","Failed to stop the packager while closing React Native Tools","Failed to run the application in Android","Failed to run the application in iOS","Failed to run the application in Expo","Failed to publish the application to Exponent","Failed to start the React Native packager","Failed to stop the React Native packager","Failed to restart the React Native packager","Cannot debug application","Cannot debug application due to an error in the internal Node Debugger","Couldn't delete the temporary folder {0}","Couldn't find the location of the node-debugger extension","Couldn't find any workspace or React Native project folder","A packager cannot be started on port {0} because a packager process is already running on port {1}","An error ocurred while handling message: {0}","Unable to set up communication with VSCode react-native extension. Is this a react-native project, and have you made sure that the react-native npm package is installed at the root?","Unknown error: not all success patterns were matched. \n It means that \"react-native run-{0}\" command failed. \n Please, check the View -> Toggle Output -> React Native, \n View -> Toggle Output -> React Native: Run {1} output windows.","Couldn't parse the version component of the package at {0}: version = {1}","Unsupported command status","No link provided by Expo. Is your project correctly setup?","Error while working with workspace: {0}","React Native version not supported by Expo. Major versions supported: {0}","User canceled login.","Cannot attach to packager. Are you sure there is a packager and it is running in the port {0}? If your packager is configured to run in another port make sure to add that to the settings.json.","Another debugger is already connected to packager. Please close it before trying to debug with VSCode.","Seems to be that you are trying to debug from within directory that is not a React Native project root. \n If so, please, follow these instructions: https://github.com/Microsoft/vscode-react-native/blob/master/doc/customization.md#project-structure.","The sourcesStoragePath argument was null or empty","Could not install the app on any available device. Make sure you have a correctly \n configured device or emulator running. See https://facebook.github.io/react-native/docs/android-setup.html.","An Android shell command timed-out. Please retry the operation.","Android project not found.","More than one device/emulator","Failed to launch the specified activity. Try running application manually and start debugging using 'Attach to packager' launch configuration.","Found more than one executables in {0}. Please cleanup build folder or setup 'productName' launch option.","Could not found executable in {0}","'rnpm-plugin-windows' is not installed.","React Devtools is not installed. Run `npm install -g react-devtools` command in your terminal to install it.","{0}. Debugging won't work: Try reloading the JS from inside the app, or Reconnect the VS Code debugger","Reconnection to the proxy (Packager) failed. Please check the output window for Packager errors, if any. If failure persists, please restart the React Native debugger.","Failed to process message from the React Native app. Message:\n{0}","Failed to prepare the JavaScript runtime environment. Message:\n{0}","Failed to send message to the React Native app. Message:\n{0}","React Native worker process thrown an error","Couldn't import script at <{0}>","RNMessage with method 'executeApplicationScript' doesn't have 'url' property"],"src/debugger/appWorker":["Disconnected from the Proxy (Packager) to the React Native application. Retrying reconnection soon...","Established a connection with the Proxy (Packager) to the React Native application"],"src/debugger/nodeDebugWrapper":["Couldn't stop monitoring logcat: {0}","Launched debug configuration contains 'program' property which is deprecated and will be removed soon. Please replace it with: \"cwd\": \"${workspaceFolder}\"","Starting debugger app worker.","Debugger worker loaded runtime on port {0}","Could not debug. {0}"],"src/debugger/reactNativeDebugEntryPoint":["Unable to start debug adapter: {0}"],"src/extension/commandPaletteHandler":["Publishing was unsuccessful. Please make sure you are logged in Expo and your project is a valid Expo project","Another element inspector already run","Publishing app to Expo server. This might take a moment.","Expo app successfully published to {0}","An error has occured. Please make sure you are logged in to Expo, your project is setup correctly for publishing and your packager is running as Expo."],"src/extension/debugConfigurationProvider":["Run and debug Android application","Run and debug iOS application","Attach to already working application packager","Debug Expo application or React Native application in Expo","Pick debug configurations"],"src/extension/extensionServer":["Prewarming bundle cache. This may take a while ...","Building and running application.","Enable JS Debugging"],"src/extension/generalMobilePlatform":["React Native: Run {0}","Connected to packager. You can now open your app in the simulator.","Debugger ready. Enable remote debugging in app.","Debugger ready. Disable remote debugging in app.","Starting React Native Packager.","Attaching to running React Native packager"],"src/extension/openFileAtLocation":["Wrong number of parameters provided. Please refer to the usage of this script for proper use."],"src/extension/packagerStatusIndicator":["Start Packager","Restart Packager","Start Packager","Stop Packager","React Native Packager","{0}: Stopped","{0}: Stopping","{0}: Started","{0}: Starting"],"src/extension/qrCodeContentProvider":["Expo is running. Open your Expo app at<br/><span style=\"text-decoration: underline\">{0}</span><br/>or scan QR code below:"],"src/extension/rn-extension":["React Native Tools need React Native version 0.19.0 or later to be installed in <PROJECT_ROOT>/node_modules/","React Native: Show Developer Menu for app","React Native: Reload App","React Native: Run Element Inspector"],"src/extension/android/adb":["No sdk.dir value found in local.properties file. Using Android SDK location from PATH.","Using Android SDK location defined in android/local.properties file: {0}.","local.properties file doesn't exist. Using Android SDK location from PATH.","Couldn't read from {0}.","Using Android SDK location from PATH."],"src/extension/android/androidPlatform":["Target {0} is not supported for Android platform. \n If you want to use particular device or simulator for launching Android app,\n please specify  device id (as in 'adb devices' output) instead.","Device {0} supports only API Level {1}. \n Level {2} is needed to support port forwarding via adb reverse. \n For debugging to work you'll need <Shake or press menu button> for the dev menu, \n go into <Dev Settings> and configure <Debug Server host & port for Device> to be \n an IP address of your computer that the Device can reach. More info at: \n https://facebook.github.io/react-native/docs/debugging.html#debugging-react-native-apps","Error while monitoring LogCat"],"src/extension/android/logCatMonitor":["LogCat monitoring stopped because the process exited.","LogCat monitoring stopped because the debugging session finished"],"src/extension/exponent/exponentHelper":["Making sure your project uses the correct dependencies for Expo. This may take a while...","Checking if this is Expo app.","[Warning] Please make sure that expo package is installed locally for your project, otherwise further errors may occur. Please, run \"npm install expo --save-dev\" inside your project to install it.","You need to login to Expo. Please provide your Expo account username and password in the input boxes after closing this window. If you don't have an account, please go to https://expo.io to create one.","Expo username","Expo password"],"src/extension/exponent/exponentPlatform":["Application is running on Expo. Open your Expo app at {0} to see it.","Application is running on Expo. Please shake device and select 'Debug JS Remotely' to enable debugging."],"src/extension/ios/iOSDebugModeManager":["Unable to find plist file to configure debugging"],"src/extension/ios/iOSPlatform":["'iosRelativeProjectPath' option is deprecated. Please use 'runArguments' instead.","'--scheme' is set as 'runArguments' configuration parameter value, 'scheme' configuration parameter value will be omitted"],"src/extension/ios/simulatorPlist":["Multiple plist candidates found. Application may not be in debug mode."],"src/extension/windows/wpfPlatform":["Debugging WPF platform is not supported for this react-native-windows version({0})"]}