{"src/common/commandExecutor":["Packager arrêté","Packager introuvable"],"src/common/packager":["Impossible de lire les options du packager depuis exp.json, poursuite de l'opération...","Démarrage du packager","Le packager a démarré.","Le packager est déjà en cours d'exécution.","Packager React Native en cours d'exécution en dehors de VS Code. Pour effectuer le débogage, utilisez l'option 'Attacher au packager'","Le packager est toujours en cours d'exécution. Si le packager a démarré en dehors de VS Code, quittez le processus lié au packager via le Gestionnaire des tâches.","Le packager n'est pas en cours d'exécution","Le packager est toujours en cours d'exécution. Si le packager a démarré en dehors de VS Code, quittez le processus lié au packager via le Gestionnaire des tâches.","Le packager n'est pas en cours d'exécution","Le point d'entrée n'existe pas non plus dans index.js, ni dans index.{0}.js. Ignorer la préparation...","Prêt à obtenir : {0}","Le cache de bundle a été préparé.","Impossible de démarrer le packager.","Arrêt du packager"],"src/common/error/errorStrings":["Erreur durant l'exécution de la commande '{0}'","Échec de la commande '{0}'. Code d'erreur : {1}","Entier attendu. Impossible de lire {0}","Erreur durant l'exécution du packager React Native.","ios-deploy est introuvable. Veillez à l'installer de manière globale ('npm install -g ios-deploy')","Impossible de monter l'image de disque du développeur.","Impossible de monter l'image de disque du développeur.","Impossible de lancer l'application.","Expiration du délai de lancement de l'application. Est-ce que l'appareil est verrouillé ?","Impossible de lancer le simulateur iOS. Essayez de spécifier une autre cible.","Emplacement du package Opn introuvable","Le package 'opn' est introuvable. {0}","Échec de la recherche du package {0}. Erreur : {1}","La plateforme '{0}' n'est pas prise en charge sur la plateforme hôte : {1}","Impossible d'analyser le composant de version du package sur {0} : version = {1}","Version du projet = {0}","Couldn't find React Native version in the current workspace or folder","Impossible de lire la version = {0}","{0}. Impossible d'initialiser la télémétrie","Échec de l'activation de l'extension Outils React Native","Échec de l'installation du lanceur de stub pour le débogueur","Échec de la configuration d'IntelliSense","Échec de la configuration de l'emplacement du débogueur Node pour le débogueur","Échec de l'arrêt du packager durant la fermeture des Outils React Native","Échec de l'exécution de l'application dans Android","Échec de l'exécution de l'application dans iOS","Échec de l'exécution de l'application dans Expo","Échec de l'exécution de l'application dans Expo","Échec du démarrage du packager React Native","Échec de l'arrêt du packager React Native","Échec du redémarrage du packager React Native","Impossible de déboguer l'application","Impossible de déboguer l'application en raison d'une erreur dans le débogueur Node interne","Impossible de supprimer le dossier temporaire {0}","L'emplacement de l'extension node-debugger est introuvable","Couldn't find any workspace or React Native project folder","Impossible de démarrer un packager sur le port {0}, car un processus lié à un packager est déjà en cours d'exécution sur le port {1}","Une erreur s'est produite durant la gestion du message : {0}","Impossible de configurer la communication avec l'extension react-native de VSCode. S'agit-il d'un projet react-native et avez-vous vérifié si le package npm react-native est bien installé à la racine ?","Erreur inconnue : tous les modèles de réussite n'ont pas été mis en correspondance. \n Cela signifie l'échec de la commande \"react-native run-{0}\". \n Consultez les fenêtres Sortie via Affichage -> Activer/désactiver la sortie -> React Native, \n Affichage -> Activer/désactiver la sortie -> React Native : exécuter {1}.","Impossible d'analyser le composant de version du package sur {0} : version = {1}","État de la commande non pris en charge","Aucun lien fourni par Expo. Votre projet est-il correctement configuré ?","Erreur durant l'utilisation de l'espace de travail : {0}","Version de React Native non prise en charge par Expo. Versions principales prises en charge : {0}","L'utilisateur a annulé la connexion.","Impossible d'effectuer l'attachement au packager. Êtes-vous sûr qu'il existe un packager et qu'il s'exécute sur le port {0} ? Si votre packager est configuré pour s'exécuter sur un autre port, ajoutez-le à settings.json.","Un autre débogueur est déjà connecté au packager. Fermez-le avant d'essayer d'effectuer le débogage avec VSCode.","Apparemment, vous tentez d'effectuer le débogage à partir d'un répertoire qui n'est pas une racine de projet React Native. \n Si tel est le cas, suivez ces instructions : https://github.com/Microsoft/vscode-react-native/blob/master/doc/customization.md#project-structure.","L'argument sourcesStoragePath a une valeur null ou est vide","Impossible d'installer l'application sur un appareil disponible. Vérifiez qu'un appareil ou un émulateur correctement \n configuré est en cours d'exécution. Consultez https://facebook.github.io/react-native/docs/android-setup.html.","Une commande d'interpréteur de commandes Android a expiré. Réessayez l'opération.","Projet Android introuvable.","Plusieurs appareils/émulateurs","Échec du lancement de l'activité spécifiée. Essayez d'exécuter l'application manuellement et démarrez le débogage à l'aide de la configuration de lancement 'Attacher au packager'.","Plusieurs exécutables trouvés dans {0}. Nettoyez le dossier de build ou configurez l'option de lancement de 'productName'.","Exécutable introuvable dans {0}","'rnpm-plugin-windows' n'est pas installé.","React Devtools n'est pas installé. Exécutez la commande 'npm install -g react-devtools' dans votre terminal pour l'installer.","{0}. Le débogage ne fonctionne pas : essayez de recharger le JS depuis l'application, ou reconnectez le débogueur de VS Code","Échec de reconnexion au proxy (packager). Recherchez dans la fenêtre Sortie les erreurs liées au packager, le cas échéant. Si le problème persiste, redémarrez le débogueur React Native.","Échec du traitement du message à partir de l'application React Native. Message :\n{0}","Échec de la préparation de l'environnement d'exécution JavaScript. Message :\n{0}","Échec de l'envoi du message à l'application React Native Message :\n{0}","Le processus de travail React Native a levé une erreur","Impossible d'importer le script sur <{0}>","RNMessage avec la méthode 'executeApplicationScript' n'a pas de propriété 'url'"],"src/debugger/appWorker":["Arrêt de la connexion entre le proxy (packager) et l'application React Native. Nouvelle tentative de reconnexion dans peu de temps...","Connexion établie entre le proxy (packager) et l'application React Native"],"src/debugger/nodeDebugWrapper":["Impossible d'arrêter la supervision de logcat : {0}","La configuration de débogage lancée contient la propriété 'program'. Celle-ci est dépréciée et sera bientôt supprimée. Remplacez-la par : \"cwd\": \"${workspaceFolder}\"","Démarrage du thread de travail du débogueur.","Le thread de travail du débogueur a chargé le runtime sur le port {0}","Impossible d'effectuer le débogage. {0}"],"src/debugger/reactNativeDebugEntryPoint":["Impossible de démarrer l'adaptateur de débogage : {0}"],"src/extension/commandPaletteHandler":["Échec de la publication. Vérifiez que vous êtes connecté à Expo et que votre projet est un projet Expo valide","Un autre inspecteur d'élément a déjà été exécuté","Publication de l'application sur le serveur Expo. L'opération peut prendre un certain temps.","Application Expo publiée correctement sur {0}","Une erreur s'est produite. Vérifiez que vous êtes connecté à Expo, que votre projet est correctement configuré pour la publication et que votre packager s'exécute en tant qu'Expo."],"src/extension/debugConfigurationProvider":["Exécuter et déboguer l'application Android","Exécuter et déboguer l'application iOS","Attacher au packager d'application en cours d'utilisation","Déboguer l'application Expo ou l'application React Native dans Expo","Choisir les configurations de débogage"],"src/extension/extensionServer":["Préchauffage du cache de bundle. L'opération peut prendre du temps...","Génération et exécution de l'application.","Activer le débogage JS"],"src/extension/generalMobilePlatform":["React Native : exécuter {0}","Connecté au packager. Vous pouvez désormais ouvrir votre application dans le simulateur.","Débogueur prêt. Activez le débogage à distance dans l'application.","Débogueur prêt. Désactivez le débogage à distance dans l'application.","Démarrage du packager React Native.","Attachement au packager React Native en cours d'exécution"],"src/extension/openFileAtLocation":["Nombre incorrect de paramètres fournis. Consultez les informations relatives à ce script pour l'utiliser de manière appropriée."],"src/extension/packagerStatusIndicator":["Démarrer le packager","Redémarrer le packager","Démarrer le packager","Arrêter le packager","Packager React Native","{0} : arrêté","{0} : arrêt en cours","{0} : démarré","{0} : démarrage en cours"],"src/extension/qrCodeContentProvider":["Expo est en cours d'exécution. Ouvrez votre application Expo sur <br/><span style=\"text-decoration: underline\">{0}</span><br/>ou scannez le code QR ci-dessous :"],"src/extension/rn-extension":["React Native Tools nécessite l'installation de React Native version 0.19.0 ou ultérieure dans <RACINE_PROJET>/node_modules/","React Native : afficher le menu du développeur pour l'application","React Native : recharger l'application","React Native : exécuter l'inspecteur d'élément"],"src/extension/android/adb":["Valeur sdk.dir introuvable dans le fichier local.properties. Utilisation de l'emplacement du kit Android SDK à partir de PATH.","Utilisation de l'emplacement du kit Android SDK défini dans le fichier android/local.properties : {0}.","Le fichier local.properties n'existe pas. Utilisation de l'emplacement du kit Android SDK à partir de PATH.","Impossible de lire à partir de {0}.","Utilisation de l'emplacement du kit Android SDK à partir de PATH."],"src/extension/android/androidPlatform":["La cible {0} n'est pas prise en charge pour la plateforme Android. \n Si vous souhaitez utiliser un appareil ou un simulateur particulier pour lancer une application Android,\n spécifiez plutôt l'ID de l'appareil (comme dans la sortie 'appareils adb').","L'appareil {0} prend uniquement en charge le niveau d'API {1}. \n Le niveau {2} est nécessaire pour la prise en charge du réacheminement de port via adb reverse. \n Pour que le débogage fonctionne, vous devez <secouer l'appareil ou appuyer sur le bouton de menu> afin d'afficher le menu de développement, \n accéder à <Dev Settings (Paramètres de développement)>, puis configurer <Debug Server host & port for Device (Déboguer l'hôte et le port du serveur pour l'appareil)> à l'aide \n de l'adresse IP de l'ordinateur accessible à l'appareil. Plus d'informations sur : \n https://facebook.github.io/react-native/docs/debugging.html#debugging-react-native-apps","Erreur durant la supervision de LogCat"],"src/extension/android/logCatMonitor":["La supervision de LogCat s'est arrêtée, car le processus a pris fin.","La supervision de LogCat s'est arrêtée, car la session de débogage a pris fin"],"src/extension/exponent/exponentHelper":["Vérification de l'utilisation par votre projet des dépendances appropriées pour Expo. L'opération peut prendre du temps...","Vérification permettant de déterminer s'il s'agit bien de l'application Expo.","[Avertissement] Vérifiez que le package expo est installé localement pour votre projet. Sinon, d'autres erreurs risquent de se produire. Exécutez \"npm install expo --save-dev\" dans votre projet pour l'installer.","Vous devez vous connecter à Expo. Indiquez votre nom d'utilisateur et votre mot de passe de compte Expo dans les zones d'entrée après la fermeture de cette fenêtre. Si vous n'avez pas de compte, accédez à https://expo.io pour en créer un.","Nom d'utilisateur Expo","Mot de passe Expo"],"src/extension/exponent/exponentPlatform":["L'application s'exécute sur Expo. Ouvrez votre application Expo sur {0} pour la voir.","L'application s'exécute sur Expo. Secouez l'appareil et sélectionnez 'Debug JS Remotely (Déboguer JS à distance)' pour activer le débogage."],"src/extension/ios/iOSDebugModeManager":["Le fichier plist de configuration du débogage est introuvable"],"src/extension/ios/iOSPlatform":["L'option 'iosRelativeProjectPath' est dépréciée. Utilisez 'runArguments' à la place.","'--scheme' est défini avec la valeur du paramètre de configuration 'runArguments', la valeur du paramètre de configuration 'scheme' sera omise"],"src/extension/ios/simulatorPlist":["Plusieurs candidats plist trouvés. L'application n'est peut-être pas en mode débogage."],"src/extension/windows/wpfPlatform":["Le débogage de plateforme WPF n'est pas pris en charge pour cette version Windows de React Native ({0})"]}