{"src/common/commandExecutor":["El empaquetador se ha detenido.","No se encontró el empaquetador."],"src/common/packager":["No se pueden leer las opciones del empaquetador de exp.json, continuar...","Iniciando el empaquetador","El empaquetador se ha iniciado.","El empaquetador ya se está ejecutando.","El empaquetador de React Native se está ejecutando fuera de VS Code. Si quiere depurar, use la opción \"Attach to packager\".","El empaquetador aún se está ejecutando. Si se inició fuera de VS Code, cierre el proceso del empaquetador con el administrador de tareas.","El empaquetador no se está ejecutando.","El empaquetador aún se está ejecutando. Si se inició fuera de VS Code, cierre el proceso del empaquetador con el administrador de tareas.","El empaquetador no se está ejecutando.","El punto de entrada no existe en index.js ni en index.{0}.js. Omitir la preparación...","Descarga que se va a obtener: {0}","El conjunto en caché se ha preparado.","No se pudo iniciar el empaquetador.","Deteniendo el empaquetador"],"src/common/error/errorStrings":["Error al ejecutar el comando \"{0}\"","Error del comando \"{0}\" con el código {1}","Se esperaba un entero. No se pudo leer {0}","Error al ejecutar el empaquetador de React Native.","No se encuentra ios-deploy. Asegúrese de instalarlo de forma global (\"npm install -g ios-deploy\")","No se puede montar la imagen de disco del desarrollador.","No se puede montar la imagen de disco del desarrollador.","No se puede iniciar la aplicación.","Se agotó el tiempo de espera de inicio de la aplicación. ¿Está bloqueado el dispositivo?","No se puede iniciar el simulador de iOS. Pruebe a especificar otro destino.","No se encontró la ubicación del paquete opn.","No se encontró el paquete \"opn\". {0}","Error al intentar encontrar el paquete {0}: {1}","No se admite la plataforma \"{0}\" en la plataforma host: {1}","No se pudo analizar el componente de versión del paquete en {0}: versión = {1}","Versión del proyecto: {0}","Couldn't find React Native version in the current workspace or folder","No se puede leer la versión {0}","{0}. No se pudo inicializar la telemetría","No se pudo activar la extensión Herramientas de React Native.","No se pudo configurar el iniciador de código auxiliar para el depurador.","No se pudo configurar IntelliSense.","No se pudo configurar la ubicación del depurador de Node para el depurador.","No se pudo detener el empaquetador al cerrar las Herramientas de React Native.","No se pudo ejecutar la aplicación en Android.","No se pudo ejecutar la aplicación en iOS.","No se pudo ejecutar la aplicación en Expo.","No se pudo ejecutar la aplicación en Expo.","No se pudo iniciar el empaquetador de React Native.","No se pudo detener el empaquetador de React Native.","No se pudo reiniciar al empaquetador de React Native.","No se puede depurar la aplicación","No se puede depurar la aplicación debido a un error en el depurador de Node interno.","No se pudo eliminar la carpeta temporal {0}","No se encontró la ubicación de la extensión node-debugger","Couldn't find any workspace or React Native project folder","No se puede iniciar un empaquetador en el puerto {0} porque ya se está ejecutando un proceso de empaquetador en el puerto {1}.","Error al administrar el mensaje: {0}","No se puede establecer comunicación con la extensión react-native de VSCode. ¿Es este un proyecto de react-native? ¿Se ha asegurado de que el paquete npm de react-native está instalado en la raíz?","Error desconocido: no se encontraron coincidencias para todos los patrones de éxito. \n Esto implica un error del comando \"react-native run-{0}\". \n Consulte Ver -> Alternar salida -> React Native, \n Ver -> Alternar salida -> React Native: Run {1} output windows.","No se pudo analizar el componente de versión del paquete en {0}: versión = {1}","Estado de comando no admitido","Expo no ha proporcionado ningún vínculo. ¿Se ha configurado correctamente el proyecto?","Error al usar el área de trabajo: {0}","Expo no admite la versión de React Native. Versiones principales admitidas: {0}","El usuario ha cancelado el inicio de sesión.","No se puede asociar al empaquetador. ¿Seguro que hay un empaquetador y que se está ejecutando en el puerto {0}? Si el empaquetador está configurado para ejecutarse en otro puerto, asegúrese de agregarlo a settings.json.","Ya hay otro depurador conectado al empaquetador. Ciérrelo antes de intentar depurar con VSCode.","Parece que está intentando depurar desde un directorio que no es raíz del proyecto de React Native. \n En ese caso, siga estas instrucciones: https://github.com/Microsoft/vscode-react-native/blob/master/doc/customization.md#project-structure.","El argumento sourcesStoragePath era nulo o estaba vacío.","No se pudo instalar la aplicación en ningún dispositivo disponible. Asegúrese de tener un emulador o un dispositivo \n configurado correctamente en ejecución. Consulte https://facebook.github.io/react-native/docs/android-setup.html.","Se agotó el tiempo de espera de un comando shell de Android. Reintente la operación.","No se ha encontrado ningún proyecto de Android.","Más de un dispositivo o emulador","No se pudo iniciar la actividad especificada. Pruebe a ejecutar la aplicación manualmente e inicie la depuración con la configuración de inicio \"Attach to packager\".","Se encontró más de un ejecutable en {0}. Limpie la carpeta de compilación o configure la opción de inicio \"productName\".","No se encontró el ejecutable en {0}","No se ha instalado \"rnpm-plugin-windows\".","React DevTools no está instalado. Ejecute el comando \"npm install -g react-devtools\" en el terminal para instalarlo.","{0}. La depuración no funcionará: pruebe a recargar JS desde dentro de la aplicación o vuelva a conectar el depurador VS Code","Error al volver a conectarse al proxy (empaquetador). Consulte la ventana de salida para ver los errores del empaquetador, si los hay. Si el error persiste, reinicie el depurador de React Native.","No se pudo procesar el mensaje de la aplicación React Native. Mensaje:\n{0}","No se pudo preparar el entorno de ejecución de JavaScript. Mensaje:\n{0}","No se pudo enviar el mensaje a la aplicación React Native. Mensaje:\n{0}","El proceso de trabajo de React Native generó un error.","No se pudo importar el script en <{0}>","El elemento RNMessage con el método \"executeApplicationScript\" no tiene la propiedad \"url\"."],"src/debugger/appWorker":["Se desconectó del proxy (empaquetador) a la aplicación React Native. Se volverá a intentar la conexión en breve...","Se estableció conexión con el proxy (empaquetador) a la aplicación React Native"],"src/debugger/nodeDebugWrapper":["No se puede detener la supervisión de LogCat: {0}","La configuración de depuración iniciada contiene la propiedad \"program\", que está en desuso y se quitará en breve. Reemplácela por: \"cwd\": \"${workspaceFolder}\".","Iniciando el trabajo de aplicación del depurador.","El trabajo del depurador cargó el entorno de ejecución en el puerto {0}","No se pudo depurar. {0}"],"src/debugger/reactNativeDebugEntryPoint":["No se puede iniciar el adaptador de depuración: {0}"],"src/extension/commandPaletteHandler":["La publicación no se ha realizado correctamente. Asegúrese de haber iniciado sesión en Expo y de que el proyecto es válido para Expo.","Ya se ha ejecutado otro inspector de elementos","Publicando la aplicación en el servidor de Expo. Esto puede tardar unos minutos.","La aplicación Expo se publicó correctamente en {0}","Se ha producido un error. Asegúrese de que ha iniciado sesión en Expo, el proyecto se ha configurado correctamente para su publicación y el empaquetador se está ejecutando como Expo."],"src/extension/debugConfigurationProvider":["Ejecuta y depura una aplicación Android.","Ejecuta y depura una aplicación iOS.","Asocia al empaquetador de aplicaciones en funcionamiento.","Depura una aplicación Expo o React Native en Expo.","Seleccionar configuraciones de depuración"],"src/extension/extensionServer":["Preparando el conjunto en caché. Este proceso puede tardar unos minutos...","Compilando y ejecutando la aplicación.","Habilitar la depuración de JS"],"src/extension/generalMobilePlatform":["React Native: Ejecutar {0}","Conectada al empaquetador. Ahora puede abrir la aplicación en el simulador.","El depurador está listo. Habilite la depuración remota en la aplicación.","El depurador está listo. Deshabilite la depuración remota en la aplicación.","Iniciando el empaquetador de React Native.","Asociando al empaquetador de React Native en ejecución"],"src/extension/openFileAtLocation":["Se ha proporciona un número de parámetros incorrecto. Consulte el uso de este script para utilizarlo correctamente."],"src/extension/packagerStatusIndicator":["Iniciar el empaquetador","Reiniciar el empaquetador","Iniciar el empaquetador","Detener el empaquetador","Empaquetador de React Native","{0}: detenido","{0}: deteniéndose","{0}: iniciado","{0}: iniciándose"],"src/extension/qrCodeContentProvider":["Expo se está ejecutando. Abra la aplicación Expo en<br/><span style=\"text-decoration: underline\">{0}</span><br/>o escanee el código QR a continuación:"],"src/extension/rn-extension":["React Native Tools necesita React Native versión 0.19.0 o posterior para instalarse en <RAÍZ_PROYECTO>/node_modules/","React Native: Mostrar menú para desarrolladores de la aplicación","React Native: Volver a cargar la aplicación","React Native: Ejecutar inspector de elementos"],"src/extension/android/adb":["No se encontró el valor sdk.dir en el archivo local.properties. Se usa la ubicación de Android SDK de PATH.","Se usa la ubicación de Android SDK definida en un archivo android/local.properties: {0}.","El archivo local.properties no existe. Se usa la ubicación de Android SDK de PATH.","No se pudo leer de {0}.","Se usa la ubicación de Android SDK de PATH."],"src/extension/android/androidPlatform":["No se admite el destino {0} para la plataforma Android. \n Si quiere usar un simulador o un dispositivo concreto para iniciar la aplicación Android,\n especifique el identificador del dispositivo (como en la salida \"adb devices\") en su lugar.","El dispositivo {0} solo admite el nivel de API {1}. \n Es necesario el nivel {2} para admitir el enrutamiento de puerto mediante adb reverse. \n Para que la depuración funcione, tendrá que usar <Shake or press menu button> en el menú para desarrolladores, \n ir a <Dev Settings> y configurar <Debug Server host & port for Device> para \n usar una dirección IP de su equipo a la que el dispositivo pueda acceder. Para obtener más información, consulte: \n https://facebook.github.io/react-native/docs/debugging.html#debugging-react-native-apps","Error al supervisar LogCat"],"src/extension/android/logCatMonitor":["La supervisión de LogCat se ha detenido porque el proceso ha terminado.","La supervisión de LogCat se ha detenido porque la sesión de depuración ha finalizado."],"src/extension/exponent/exponentHelper":["Asegúrese de que el proyecto usa las dependencias correctas para Expo. Este proceso puede tardar unos minutos...","Comprobando si esta aplicación es Expo.","[Advertencia] Asegúrese de que el paquete Expo se ha instalado localmente para el proyecto ya que, de lo contrario, puede que se produzcan más errores. Ejecute \"npm install expo --save-dev\" dentro del proyecto para instalarlo.","Debe iniciar sesión en Expo. Proporcione el nombre de usuario y la contraseña de la cuenta de Expo en los cuadros de entrada después de cerrar esta ventana. Si no tiene una cuenta, vaya a https://expo.io para crearla.","Nombre de usuario de Expo","Contraseña de Expo"],"src/extension/exponent/exponentPlatform":["La aplicación se está ejecutando en Expo. Abra la aplicación de Expo en {0} para verla.","La aplicación se está ejecutando en Expo. Agite el dispositivo y seleccione \"Debug JS Remotely\" para habilitar la depuración."],"src/extension/ios/iOSDebugModeManager":["No se encuentra el archivo plist para configurar la depuración."],"src/extension/ios/iOSPlatform":["La opción \"iosRelativeProjectPath\" está en desuso. Use \"runArguments\" en su lugar.","\"--scheme\" está establecido como el valor del parámetro de configuración \"runArguments\"; el valor del parámetro de configuración \"scheme\" se omitirá."],"src/extension/ios/simulatorPlist":["Se han encontrado varios candidatos de archivos plist. Puede que la aplicación no esté en modo de depuración."],"src/extension/windows/wpfPlatform":["No se admite la depuración de la plataforma de WPF para esta versión de react-native-windows ({0})"]}