{"src/common/commandExecutor":["Lo strumento per la creazione di pacchetti è stato arrestato","Lo strumento per la creazione di pacchetti non è stato trovato"],"src/common/packager":["Non è stato possibile leggere le opzioni dello strumento per la creazione di pacchetti da exp.json. L'operazione continuerà...","Avvio dello strumento per la creazione di pacchetti","Lo strumento per la creazione di pacchetti è stato avviato.","Lo strumento per la creazione di pacchetti è già in esecuzione.","Lo strumento per la creazione di pacchetti React Native non viene eseguito in VS Code. Per eseguire il debug, usare l'opzione 'Collega a strumento per la creazione di pacchetti'","Lo strumento per la creazione di pacchetti è ancora in esecuzione. Se non è stato avviato in VS Code, chiudere il processo dello strumento di gestione pacchetti da Gestione attività.","Lo strumento per la creazione di pacchetti non è in esecuzione","Lo strumento per la creazione di pacchetti è ancora in esecuzione. Se non è stato avviato in VS Code, chiudere il processo dello strumento di gestione pacchetti da Gestione attività.","Lo strumento per la creazione di pacchetti non è in esecuzione","Il punto di ingresso non esiste alla posizione di index.js o di index.{0}.js. Il preriscaldamento non verrà eseguito...","Verrà scaricato: {0}","La cache del bundle è stata preriscaldata.","Non è stato possibile avviare lo strumento per la creazione di pacchetti.","Arresto dello strumento per la creazione di pacchetti"],"src/common/error/errorStrings":["Si è verificato un errore durante l'esecuzione del comando '{0}'","Il comando '{0}' non è riuscito. Codice errore: {1}","È previsto un intero. Non è stato possibile leggere {0}","Si è verificato un errore durante l'esecuzione dello strumento per la creazione di pacchetti React Native.","Non è possibile trovare ios-deploy. Assicurarsi di installarlo globalmente ('npm install -g ios-deploy')","Non è possibile montare l'immagine del disco per sviluppatori.","Non è possibile montare l'immagine del disco per sviluppatori.","Non è possibile avviare l'applicazione.","Si è verificato un timeout durante l'avvio dell'applicazione. Il dispositivo è bloccato?","Non è possibile avviare il simulatore di iOS. Provare a specificare una destinazione diversa.","Il percorso del pacchetto opn non è stato trovato","Il pacchetto 'opn' non è stato trovato. {0}","Il tentativo di individuazione del pacchetto {0} non è riuscito. Errore: {1}","La piattaforma '{0}' non è supportata nella piattaforma host: {1}","Non è stato possibile analizzare il componente della versione del pacchetto alla posizione {0}. Versione = {1}","Versione del progetto = {0}","Couldn't find React Native version in the current workspace or folder","Non è possibile leggere la versione = {0}","{0}. Non è stato possibile inizializzare la telemetria","Non è stato possibile attivare l'estensione React Native Tools","Non è stato possibile configurare l'utilità di avvio stub per il debugger","Non è stato possibile configurare IntelliSense","Non è stato possibile configurare il percorso del debugger di Node per il debugger","Non è stato possibile avviare lo strumento per la creazione di pacchetti React Native durante la chiusura di React Native Tools","Non è stato possibile eseguire l'applicazione in Android","Non è stato possibile eseguire l'applicazione in iOS","Non è stato possibile eseguire l'applicazione in Expo","Non è stato possibile eseguire l'applicazione in Expo","Non è stato possibile avviare lo strumento per la creazione di pacchetti React Native","Non è stato possibile arrestare lo strumento per la creazione di pacchetti React Native","Non è stato possibile riavviare lo strumento per la creazione di pacchetti React Native","Non è possibile eseguire il debug dell'applicazione","Non è possibile eseguire il debug dell'applicazione a causa di un errore nel debugger di Node interno","Non è stato possibile eliminare la cartella temporanea {0}","Non è stato possibile trovare il percorso dell'estensione del debugger Node","Couldn't find any workspace or React Native project folder","Non è possibile avviare uno strumento per la creazione di pacchetti sulla porta {0} perché un processo dello strumento per la creazione di pacchetti è già in esecuzione sulla porta {1}","Si è verificato un errore durante la gestione del messaggio: {0}","Non è possibile configurare la comunicazione con l'estensione react-native VS Code. È realmente un progetto react-native ed è stato verificato che il pacchetto npm react-native sia stato nella radice?","Errore sconosciuto: non è stato possibile abbinare tutti i criteri di riuscita. \n Il comando \"react-native run-{0}\" non è riuscito. \n Verificare le finestre di output in Visualizza -> Attiva/Disattiva output -> React Native o \n Visualizza -> Attiva/Disattiva output -> React Native: Esegui {1}.","Non è stato possibile analizzare il componente della versione del pacchetto alla posizione {0}. Versione = {1}","Lo stato del comando non è supportato","Expo non ha fornito alcun collegamento. Il progetto è correttamente configurato?","Si è verificato un errore durante l'uso dell'area di lavoro: {0}","Expo non supporta la versione di React Native. Versioni principali supportate: {0}","Accesso annullato dall'utente.","Non è possibile collegarsi allo strumento per la creazione di pacchetti. Si è sicuri che lo strumento per la creazione di pacchetti sia presente e che sia in esecuzione sulla porta {0}? Se lo strumento per la creazione di pacchetti è configurato per l'esecuzione su un'altra porta, assicurarsi di aggiungere tale impostazione a settings.json.","Allo strumento per la creazione di pacchetti è già connesso un altro debugger. Chiuderlo prima di provare a eseguire il debug con VS Code.","Sembra che si stia eseguendo il debug da una directory che non è una radice di progetto React Native. \n In tal caso, seguire queste istruzioni: https://github.com/Microsoft/vscode-react-native/blob/master/doc/customization.md#project-structure.","L'argomento sourcesStoragePath è Null o vuoto","Non è stato possibile installare l'app in nessun dispositivo disponibile. \n Assicurarsi che sia in esecuzione un dispositivo o un emulatore configurato correttamente. Vedere https://facebook.github.io/react-native/docs/android-setup.html.","Si è verificato un timeout del comando della shell di Android. Ripetere l'operazione.","Il progetto Android non è stato trovato.","È presente più di un dispositivo/emulatore","Non è stato possibile avviare l'attività specificata. Provare a eseguire l'applicazione manualmente e avviare il debug con la configurazione di avvio 'Collega a strumento per la creazione di pacchetti'.","Sono stati trovati più eseguibili in {0}. Pulire la cartella delle compilazioni oppure configurare l'opzione di avvio 'productName'.","Non è stato possibile trovare l'eseguibile in {0}","'rnpm-plugin-windows' non è installato.","React Devtools non è installato. Per installarlo, eseguire il comando `npm install -g react-devtools` nel terminale.","{0}. Il debug non funziona: provare a ricaricare JS dall'interno dell'app oppure riconnettere il debugger VS Code","La riconnessione al proxy (Strumento per la creazione di pacchetti) non è riuscita. Verificare la presenza di eventuali errori dello strumento per la creazione di pacchetti nella finestra di output. Se l'errore persiste, riavviare il debugger React Native.","Non è stato possibile elaborare il messaggio dall'app React Native. Messaggio:\n{0}","Non è stato possibile preparare l'ambiente di runtime JavaScript. Messaggio:\n{0}","Non è stato possibile inviare il messaggio all'app React Native. Messaggio:\n{0}","Il processo di lavoro di React Native ha generato un errore","Non è stato possibile importare lo script alla posizione <{0}>","RNMessage con metodo 'executeApplicationScript' non contiene la proprietà 'url'"],"src/debugger/appWorker":["La connessione dal proxy (strumento per la creazione di pacchetti) all'applicazione React Native è stata chiusa. A breve verrà effettuato un nuovo tentativo di riconnessione...","È stata stabilita una connessione con il proxy (strumento per la creazione di pacchetti) all'applicazione React Native"],"src/debugger/nodeDebugWrapper":["Non è stato possibile arrestare il monitoraggio di LogCat: {0}","La configurazione di debug avviata contiene la proprietà 'Program' che è deprecata e verrà rimossa a breve. Sostituirla con: \"cwd\": \"${workspaceFolder}\"","Avvio del processo di lavoro dell'app debugger.","Il processo di lavoro del debugger ha caricato il runtime sulla porta {0}","Non è stato possibile eseguire il debug. {0}"],"src/debugger/reactNativeDebugEntryPoint":["Non è possibile avviare l'adattatore di debug: {0}"],"src/debugger/direct/directDebugAdapter":["Couldn't stop monitoring logcat: {0}"],"src/debugger/direct/reactNativeDirectDebugEntryPoint":["Unable to start debug adapter: {0}"],"src/extension/commandPaletteHandler":["La pubblicazione non è riuscita. Assicurarsi che sia stato eseguito l'accesso a Expo e che il progetto sia un progetto Expo valido","È già in esecuzione un altro controllo elementi","Pubblicazione dell'app nel server Expo. L'operazione potrebbe richiedere qualche minuto.","L'app Expo è stata pubblicata in {0}","Si è verificato un errore. Assicurarsi che l'accesso a Expo sia stato eseguito, che il progetto sia configurato correttamente per la pubblicazione e che lo strumento per la creazione di pacchetti venga eseguito come Expo."],"src/extension/debugConfigurationProvider":["Esegue l'applicazione Android e ne esegue il debug","Esegue l'applicazione iOS e ne esegue il debug","Si collega allo strumento per la creazione di pacchetti di applicazioni","Esegue il debug dell'applicazione Expo o dell'applicazione React Native in Expo","Run and debug Android Hermes application","Attach to already working Android Hermes application packager","Seleziona configurazioni di debug"],"src/extension/extensionServer":["Preriscaldamento della cache del bundle. L'operazione potrebbe richiedere qualche minuto...","Compilazione ed esecuzione dell'applicazione.","Prepare Hermes debugging (experimental)","Abilita debug JS"],"src/extension/generalMobilePlatform":["React Native: Esegui {0}","La connessione allo strumento per la creazione di pacchetti è stata stabilita. È ora possibile aprire l'app nel simulatore.","Debugger pronto. Abilitare il debug remoto nell'app.","Debugger pronto. Disabilitare il debug remoto nell'app.","Avvio dello strumento per la creazione di pacchetti React Native.","Collegamento allo strumento per la creazione di pacchetti React Native in esecuzione"],"src/extension/openFileAtLocation":["È stato specificato un numero errato di parametri. Per l'uso corretto, fare riferimento alla sintassi di questo script."],"src/extension/packagerStatusIndicator":["Avvia strumento per la creazione di pacchetti","Riavvia strumento per la creazione di pacchetti","Avvia strumento per la creazione di pacchetti","Arresta strumento per la creazione di pacchetti","Strumento di creazione pacchetti React Native","{0}: arrestato","{0}: in fase di arresto","{0}: avviato","{0}: in fase di avvio"],"src/extension/qrCodeContentProvider":["Expo è in esecuzione. Aprire l'app Expo all'indirizzo<br/><span style=\"text-decoration: underline\">{0}</span><br/>oppure eseguire la scansione del codice QR di seguito:"],"src/extension/rn-extension":["Con React Native Tools è richiesta l'installazione di React Native versione 0.19.0 o successiva in <RADICE_PROGETTO>/node_modules/","React Native: Mostra menu Sviluppatore per l'app","React Native: Ricarica app","React Native: Esegui controllo elementi"],"src/extension/android/adb":["Non è stato trovato alcun valore sdk.dir nel file local.properties. Verrà usato il percorso di Android SDK di PATH.","Uso del percorso di Android SDK definito nel file android/local.properties: {0}.","Il file local.properties non esiste. Verrà usato il percorso di Android SDK di PATH.","Non è stato possibile leggere da {0}.","Verrà usato il percorso di Android SDK di PATH."],"src/extension/android/androidPlatform":["La destinazione {0} non è supportata per la piattaforma Android. \n Se si vuole usare un particolare dispositivo o simulatore per avviare l'app Android,\n specificare l'ID dispositivo (indicato nell'output di 'adb devices').","Il dispositivo {0} supporta solo il livello API {1}. \n È necessario il livello {2} per supportare il port forwarding tramite adb reverse. \n Per la corretta esecuzione del debug è necessario <scuotere o premere il pulsante di menu> per il menu Sviluppatore, \n passare a <Impostazioni sviluppo> e configurare <Host e porta server di debug per dispositivo> su \n un indirizzo IP del computer raggiungibile dal dispositivo. Per altre informazioni, vedere: \n https://facebook.github.io/react-native/docs/debugging.html#debugging-react-native-apps","Si è verificato un errore durante il monitoraggio di LogCat"],"src/extension/android/logCatMonitor":["Il monitoraggio di LogCat è stato arrestato perché il processo è stato chiuso.","Il monitoraggio di LogCat è stato arrestato perché la sessione di debug è terminata"],"src/extension/exponent/exponentHelper":["Verifica del progetto per accertarsi che usi le dipendenze corrette per Expo. L'operazione potrebbe richiedere qualche minuto...","Verifica dell'esistenza dell'app Expo.","[Avviso] Assicurarsi che il pacchetto expo sia installato in locale per il progetto, in caso contrario potrebbero verificarsi ulteriori errori. Per installarlo, eseguire \"npm install expo --save-dev\" nel progetto.","È necessario eseguire l'accesso a Expo. Dopo aver chiuso questa finestra, specificare nome utente e password dell'account Expo nelle caselle di input. Se non si dispone di un account, passare a https://expo.io per crearne uno.","Nome utente di Expo","Password di Expo"],"src/extension/exponent/exponentPlatform":["L'applicazione viene eseguita in Expo. Aprire l'app Expo all'indirizzo {0} per visualizzarla.","L'applicazione viene eseguita in Expo. Scuotere il dispositivo e selezionare 'Esegui debug JS in remoto' per abilitare il debug."],"src/extension/ios/iOSDebugModeManager":["Non è possibile trovare il file plist per configurare il debug"],"src/extension/ios/iOSPlatform":["L'opzione 'iosRelativeProjectPath' è deprecata. In alternativa, usare 'runArguments'.","'--scheme' è impostato come valore del parametro di configurazione 'runArguments'. Il valore del parametro di configurazione 'scheme' verrà omesso"],"src/extension/ios/simulatorPlist":["Sono stati trovati più candidati plist. L'applicazione potrebbe non essere in modalità di debug."],"src/extension/windows/wpfPlatform":["Il debug della piattaforma WPF non è supportato per questa versione di react-native-windows ({0})"]}