{"src/common/commandExecutor":["Balíčkovač zastaven","Balíčkovač nenalezen"],"src/common/packager":["Nepodařilo se načíst možnosti balíčkovače ze souboru exp.json, pokračuje se...","Balíčkovač se spouští.","Balíčkovač byl spuštěn.","Balíčkovač je už spuštěný.","Balíčkovač React Native je spuštěný mimo VS Code. Pokud chcete ladit, použijte možnost Attach to packager (Připojit k balíčkovači).","Balíčkovač je stále spuštěný. Pokud byl balíčkovač spuštěn mimo VS Code, ukončete prosím proces balíčkovače pomocí správce úloh.","Balíčkovač není spuštěný.","Balíčkovač je stále spuštěný. Pokud byl balíčkovač spuštěn mimo VS Code, ukončete prosím proces balíčkovače pomocí správce úloh.","Balíčkovač není spuštěný.","Vstupní bod neexistuje v souboru index.js ani v souboru index.{0}.js. Předběžná příprava se vynechává...","Chystá se načtení: {0}","Skupinová mezipaměť byla předběžně připravena.","Nepodařilo se spustit balíčkovač.","Balíčkovač se zastavuje."],"src/common/error/errorStrings":["Došlo k chybě při provádění příkazu {0}.","Příkaz {0} se nezdařil s kódem chyby {1}.","Byl očekáván typ integer. Nelze přečíst {0}.","Při spouštění balíčkovače React Native došlo k chybě.","Nepodařilo se najít ios-deploy. Zajistěte prosím, aby byl nainstalován globálně (npm install -g ios-deploy).","Nelze připojit image vývojářského disku.","Nelze připojit image vývojářského disku.","Aplikaci nelze spustit.","Vypršení časového limitu pro spuštění aplikace: Je zařízení uzamčené?","Nelze spustit simulátor iOS. Zkuste zadat jiný cíl.","Umístění balíčku opn nenalezeno","Balíček opn nebyl nalezen. {0}","Pokus o nalezení balíčku {0} se nezdařil, vrácena chyba: {1}","Platforma {0} není podporovaná na hostitelské platformě: {1}","Nebylo možné parsovat komponentu verze balíčku v {0}: verze = {1}","Verze projektu = {0}","Couldn't find React Native version in the current workspace or folder","Nelze přečíst verzi = {0}","{0}. Nepodařilo se inicializovat telemetrii.","Nepodařilo se aktivovat rozšíření Nástroje React Native.","Nepodařilo se nastavit spouštěč zástupné procedury pro ladicí program.","Nepodařilo se nastavit IntelliSense.","Nepodařilo se nakonfigurovat umístění ladicího programu uzlů pro ladicí program.","Při zavírání rozšíření Nástroje React Native se nepodařilo zastavit balíčkovač React Native.","Nepodařilo se spustit aplikaci v Androidu.","Nepodařilo se spustit aplikaci v iOSu.","Nepodařilo se spustit aplikaci v Expo.","Nepodařilo se spustit aplikaci v Expo.","Nepodařilo se spustit balíčkovač React Native.","Nepodařilo se zastavit balíčkovač React Native.","Nepodařilo se restartovat balíčkovač React Native.","Aplikaci nelze ladit.","Aplikaci nelze ladit kvůli chybě v interním ladicím programu uzlů.","Nepodařilo se odstranit dočasnou složku {0}.","Nepodařilo se najít umístění rozšíření node-debugger.","Couldn't find any workspace or React Native project folder","Balíčkovač nelze spustit na portu {0}, protože proces balíčkovače je už spuštěný na portu {1}.","Došlo k chybě při zpracování zprávy: {0}","Nelze nastavit komunikaci s rozšířením VSCode react-native. Jedná se o projekt react-native? A zkontrolovali jste, jestli je v kořenovém adresáři nainstalovaný balíček npm react-native?","Neznámá chyba: Některé úspěšné vzory se neshodovaly. \n To znamená, že příkaz react-native run-{0} selhal. \n Zkontrolujte prosím, jestli používáte nastavení View -> Toggle Output -> React Native, \n View -> Toggle Output -> React Native: Run {1} output windows.","Nebylo možné parsovat komponentu verze balíčku v {0}: verze = {1}","Nepodporovaný stav příkazu","Expo neposkytuje žádný odkaz. Je projekt správně nastavený?","Došlo k chybě při práci s pracovním prostorem: {0}","Expo nepodporuje tuto verzi React Native. Podporované hlavní verze: {0}","Uživatel zrušil přihlášení.","Nelze připojit k balíčkovači. Máte opravdu balíčkovač? A je spuštěný v portu {0}? Pokud je váš balíčkovač nakonfigurovaný ke spuštění na jiném portu, nezapomeňte ho přidat do souboru settings.json.","K balíčkovači je už připojený jiný ladicí program. Před pokusem o ladění pomocí VSCode ho prosím zavřete.","Zdá se, že zkoušíte ladit z prostředí adresáře, který není kořenovým adresářem projektu React Native. \n V tom případě prosím postupujte podle následujících pokynů: https://github.com/Microsoft/vscode-react-native/blob/master/doc/customization.md#project-structure.","Argument sourcesStoragePath měl hodnotu null nebo byl prázdný.","Aplikaci se na žádné dostupné zařízení nepodařilo nainstalovat. Ujistěte se, že máte \n správně nakonfigurované zařízení nebo spuštěný emulátor. Viz https://facebook.github.io/react-native/docs/android-setup.html.","U příkazu prostředí pro Android vypršel časový limit. Proveďte prosím tuto operaci znovu.","Projekt pro Android nebyl nalezen.","Více než jedno zařízení nebo emulátor","Zadanou aktivitu se nepodařilo spustit. Zkuste spustit aplikaci ručně a proveďte ladění pomocí konfigurace spuštění Attach to packager (Připojit k balíčkovači).","V {0} bylo nalezeno více spustitelných souborů. Vyčistěte prosím složku sestavení nebo nastavte možnost spuštění productName.","Nepodařilo se najít spustitelný soubor v {0}.","Modul plug-in Rnpm-plugin-windows není nainstalovaný.","Rozšíření React Devtools není nainstalované. Nainstalujete je tak, že na terminálu spustíte příkaz npm install -g react-devtools.","{0}. Ladění nebude fungovat: Zkuste znovu načíst JS z prostředí aplikace nebo připojte znovu ladicí program VS Code.","Při opětovném připojení proxy serveru (balíčkovače) došlo k chybě. Vyhledejte prosím chyby balíčkovače v okně výstupu, pokud nějaké existují. Pokud chyba přetrvává, restartujte prosím ladicí program React Native.","Nepodařilo se zpracovat zprávu z aplikace React Native. Zpráva:\n{0}","Nepodařilo se připravit běhové prostředí JavaScriptu. Zpráva:\n{0}","Nepodařilo se odeslat zprávu do aplikace React Native. Zpráva:\n{0}","Pracovní proces React Native vyvolal chybu.","Nepodařilo se importovat skript v <{0}>","RNMessage s metodou executeApplicationScript nemá vlastnost url."],"src/debugger/appWorker":["Proxy server (balíčkovač) se odpojil od aplikace React Native. Brzy se provede další pokus o opětovné připojení...","Vytvořilo se připojení proxy serveru (balíčkovače) k aplikaci React Native."],"src/debugger/nodeDebugWrapper":["Nepodařilo se zastavit monitorování LogCatu: {0}","Spuštěná konfigurace ladění obsahuje vlastnost program, která je zastaralá a zanedlouho se odebere. Nahraďte ji prosím tímto: \"cwd\": \"${workspaceFolder}\"","Spouští se pracovní proces aplikace ladicího programu.","Pracovní proces ladicího programu načetl modul runtime na portu {0}.","Nelze ladit. {0}"],"src/debugger/reactNativeDebugEntryPoint":["Nelze spustit adaptér ladění: {0}"],"src/debugger/direct/directDebugAdapter":["Couldn't stop monitoring logcat: {0}"],"src/debugger/direct/reactNativeDirectDebugEntryPoint":["Unable to start debug adapter: {0}"],"src/extension/commandPaletteHandler":["Publikování nebylo úspěšné. Zkontrolujte prosím, jestli jste přihlášení k Expo a váš projekt je platným projektem Expo.","Už je spuštěný jiný inspektor elementů.","Aplikace se publikuje na server Expo. Může to chvíli trvat.","Aplikace Expo byla úspěšně publikována na {0}.","Došlo k chybě. Zkontrolujte prosím, jestli jste přihlášení k Expo, váš projekt je pro publikování správně nastavený a balíčkovač je spuštěný jako Expo."],"src/extension/debugConfigurationProvider":["Spustit a ladit aplikaci pro Android","Spustit a ladit aplikaci pro iOS","Připojit k už fungujícímu nástroji pro sestavování balíčků aplikací","Aplikace Debug Expo nebo aplikace React Native v Expu","Run and debug Android Hermes application","Attach to already working Android Hermes application packager","Vybrat konfigurace ladění"],"src/extension/extensionServer":["Skupinová mezipaměť se předběžně připravuje. Může to chvíli trvat...","Aplikace se sestavuje a spouští.","Prepare Hermes debugging (experimental)","Povolit ladění JS"],"src/extension/generalMobilePlatform":["React Native: Spustit {0}","Připojeno k balíčkovači. Teď můžete aplikaci otevřít v simulátoru.","Ladicí program je připravený. Povolte vzdálené ladění v aplikaci.","Ladicí program je připravený. Zakažte vzdálené ladění v aplikaci.","Spouští se balíčkovač React Native.","Probíhá připojování ke spuštěnému balíčkovači React Native."],"src/extension/openFileAtLocation":["Byl zadán nesprávný počet parametrů. Přečtěte si prosím informace o správném použití tohoto skriptu."],"src/extension/packagerStatusIndicator":["Spustit balíčkovač","Restartovat balíčkovač","Spustit balíčkovač","Zastavit balíčkovač","Balíčkovač React Native","{0}: Zastaveno","{0}: Zastavuje se","{0}: Spuštěno","{0}: Spouští se"],"src/extension/qrCodeContentProvider":["Expo běží. Otevřete aplikaci Expo na<br/><span style=\"text-decoration: underline\">{0}</span><br/>nebo naskenujte níže uvedený kód QR:"],"src/extension/rn-extension":["Rozšíření React Native Tools vyžaduje, aby ve složce <PROJECT_ROOT>/node_modules/ byla nainstalovaná verze React Native 0.19.0 nebo novější.","React Native: Zobrazit nabídku pro vývojáře aplikace","React Native: Znovu načíst aplikaci","React Native: Spustit inspektor elementů"],"src/extension/android/adb":["V souboru local.properties nebyla nalezena žádná hodnota sdk.dir. Použije se umístění sady Android SDK z cesty.","Použije se umístění sady Android SDK definované v souboru android/local.properties: {0}.","Soubor local.properties neexistuje. Použije se umístění sady Android SDK z cesty.","Nejde číst z {0}.","Použije se umístění sady Android SDK z cesty."],"src/extension/android/androidPlatform":["Cíl {0} není podporovaný pro platformu Android. \n Pokud ke spuštění aplikace pro Android chcete použít konkrétní zařízení nebo simulátor,\n zadejte prosím místo něj ID zařízení (jako ve výstupu příkazu adb devices).","Zařízení {0} podporuje jenom rozhraní API úrovně {1}. \n Podpora přesměrování portů prostřednictvím příkazu adb reverse vyžaduje úroveň {2}. \n Aby ladění fungovalo, budete muset zatřesením nebo stisknutím tlačítka nabídky zobrazit nabídku pro vývojáře, \n přejít na <Dev Settings> a nakonfigurovat možnost <Debug Server host & port for Device> tak, aby obsahovala \n IP adresu počítače, ke kterému má dané zařízení přístup. Další informace: \n https://facebook.github.io/react-native/docs/debugging.html#debugging-react-native-apps","Došlo k chybě při monitorování LogCatu."],"src/extension/android/logCatMonitor":["Monitorování LogCatu se zastavilo, protože proces byl ukončen.","Monitorování LogCatu se zastavilo, protože ladicí relace skončila."],"src/extension/exponent/exponentHelper":["Ověřuje se, jestli projekt používá správné závislosti pro Expo. Může to chvíli trvat...","Kontroluje se, jestli se jedná o aplikaci Expo.","[Upozornění] Ujistěte se prosím, že daný balíček Expo je pro váš projekt nainstalovaný místně, jinak může docházet k dalším chybám. Nainstalujte ho prosím tak, že v projektu spustíte příkaz npm install expo --save-dev.","Je potřeba, abyste se přihlásili k Expo. Po zavření tohoto okna zadejte do vstupních polí uživatelské jméno a heslo pro Expo. Pokud nemáte účet, přejděte prosím na https://expo.io a vytvořte si ho.","Uživatelské jméno pro Expo","Heslo pro Expo"],"src/extension/exponent/exponentPlatform":["Aplikace je spuštěná na Expo. Otevřete aplikaci Expo na {0} a uvidíte ji.","Aplikace je spuštěná na Expo. Povolte prosím ladění tak, že zatřesete zařízením a vyberete Debug JS Remotely."],"src/extension/ios/iOSDebugModeManager":["Pro konfiguraci ladění se nepodařilo najít soubor plist."],"src/extension/ios/iOSPlatform":["Možnost iosRelativeProjectPath je zastaralá. Použijte prosím místo ní možnost runArguments.","Hodnota --scheme je nastavená jako hodnota parametru konfigurace runArguments, hodnota parametru konfigurace scheme se vynechá."],"src/extension/ios/simulatorPlist":["Bylo nalezeno více kandidátů plist. Je možné, že aplikace není v režimu ladění."],"src/extension/windows/wpfPlatform":["Ladění platformy WPF není podporované pro tuto verzi react-native-windows ({0})."]}